000100231109             pgm
000101231129             dcl &due *char 10 /*modificata */
000102231129             dcl &due *char 10
000103231129             dcl &due *char 10
000104231129             dcl &due *char 10
000105231129             dcl &due *char 10
000106231213
000108231213             dcl        &mara *char 20
000109231213
000110231213/* modifica proveniente da power i */
000111231213
000113231109             endpgm
000114231109
