000100231109             pgm
000101231127             dcl &due *char 10
000113231109             /* modificata pre demo */
000114231109             endpgm
999999999999
