000100231109             pgm
000101231109             dcl        &uno *char    10
000102231121             dcl        &uno *char    10
000103231121             dcl        &uno *char    10
000104231121             dcl        &uno *char    10
000105231121             dcl        &uno *char    10
000106231121             dcl        &uno *char    10
000107231109             endpgm
000108231109
