000100200603             PGM        PARM(&ID &DECO)
000200200603
000300200603             DCL        VAR(&ID) TYPE(*CHAR) LEN(7)
000400200603             DCL        VAR(&DECO) TYPE(*CHAR) LEN(512)
000500200603
000600200603             RTVMSG     MSGID(&ID) MSGF(QSYS/QCPFMSG) MSG(&DECO)
000700200603             MONMSG     MSGID(CPF0000)
000800200603
000900200603 skip:       ENDPGM
